In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql sqlite:///practice.db

# This is for where clauses and filtering

In [2]:
# Syntax

# SELECT ...
#   FROM ...
#   WHERE condition;

# Operators: =, != or <>, <, >, <=, >=, BETWEEN, LIKE, IN, IS NULL

In [5]:
%%sql

-- Filter for employees with salary more than 7000

SELECT * FROM employees WHERE salary > 7000;

 * sqlite:///practice.db
Done.

[(1, 'Alice', 1, 90000, '2018-03-21'),
 (2, 'Bob', 1, 80000, '2019-07-15'),
 (3, 'Charlie', 2, 65000, '2020-01-10'),
 (4, 'Dana', 3, 70000, '2017-09-05'),
 (5, 'Eve', None, 72000, '2021-11-23')]

In [6]:
%%sql

-- Filter for customers in London or Paris

SELECT * FROM customers WHERE city IN ('London', 'Paris');

 * sqlite:///practice.db
Done.

[(1, 'Acme Corp', 'London'), (3, 'Cafe 123', 'Paris')]

In [7]:
%%sql
-- Name contains 'a' (case-sensitive in SQLite by default)
  SELECT * FROM employees WHERE name LIKE '%a%';

 * sqlite:///practice.db
Done.

[(1, 'Alice', 1, 90000, '2018-03-21'),
 (3, 'Charlie', 2, 65000, '2020-01-10'),
 (4, 'Dana', 3, 70000, '2017-09-05')]

In [8]:
%%sql
-- Employees without departments
SELECT * FROM employees WHERE dept_id IS NULL;

 * sqlite:///practice.db
Done.

[(5, 'Eve', None, 72000, '2021-11-23')]

# Questions

In [ ]:
# Exercises

# 1. Find products cheaper than 10.
# 2. Find orders after '2023-05-02'.
# 3. List employees hired before 2019.

# Answers

In [ ]:
%%sql
-- 1
SELECT * FROM products WHERE price < 10;

 * sqlite:///practice.db
Done.

[(3, 'Mug', 'Home', 8.5), (4, 'Notebook', 'Stationery', 3.5)]

In [15]:
%%sql
-- 2
SELECT * FROM orders WHERE order_date > '2023-05-02';

 * sqlite:///practice.db
Done.

[(2, 3, '2023-05-03', 11.0), (3, 2, '2023-06-15', 2400.0)]

In [18]:
%%sql
-- 3
SELECT * FROM employees WHERE hire_date < '2019%';

 * sqlite:///practice.db
Done.

[(1, 'Alice', 1, 90000, '2018-03-21'), (4, 'Dana', 3, 70000, '2017-09-05')]

# Solutions

In [ ]:
# 1 - SELECT * FROM products WHERE price < 10;
# 2 - SELECT * FROM orders WHERE order_date > '2023-05-02';
# 3 - SELECT * FROM employees WHERE hire_date < '2019-01-01';